# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.00  # model depth multiple
width_multiple: 1.00  # layer channel multiple
anchors: [[16,19], [55,65], [178,192]]

# YOLOv8 v0.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0-P0
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2
   [-1, 1, Conv, [64, 3, 1]],  # 2-P0
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4
   [-1, 3, C2, [128, True]],
   [-1, 1, Conv, [256, 3, 2]],  # 5-P3/8
   [-1, 6, C2, [256, True]],
   [-1, 1, Conv, [512, 3, 2]],  # 7-P4/16
   [-1, 6, C2, [512, True]],
   [-1, 1, Conv, [768, 3, 2]],  # 9-P5/32
   [-1, 3, C2, [768, True]],
   [-1, 1, SPPF, [768, 5]],  # 11
  ]

# YOLOv8 v0.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 7], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C2, [512, False]],  # 15

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C2, [256, False]],  # 19 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 15], 1, Concat, [1]],  # cat head P4
   [-1, 3, C2, [512, False]],  # 22 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 11], 1, Concat, [1]],  # cat head P5
   [-1, 3, C2, [768, False]],  # 25 (P5/32-large)

   [[19, 22, 25], 1, V6Detect, [nc]],  # Detect(P3, P4, P5)
  ]
