# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors: 3  # AutoAnchor evolves 3 anchors per P output layer

# YOLOv5 v7.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 3, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3x, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3x, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3x, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3x, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v7.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, DWConvTranspose2d, [512, 4, 2, 1]],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3x, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, DWConvTranspose2d, [256, 4, 2, 1]],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3x, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3x, [512, False]],  # 20 (P4/16-medium)

   [[17, 20], 1, Detect, [nc, anchors]],  # Detect(P3, P4)
  ]
