7767517
223 257
Input                    in0                      0 1 in0
Convolution              conv_9                   1 1 in0 1 0=32 1=6 11=6 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=3456
Swish                    silu_75                  1 1 1 2
Convolution              conv_10                  1 1 2 3 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432
Swish                    silu_76                  1 1 3 4
Split                    splitncnn_0              1 2 4 5 6
Convolution              conv_11                  1 1 6 7 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_77                  1 1 7 8
Split                    splitncnn_1              1 2 8 9 10
Convolution              conv_12                  1 1 10 11 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_78                  1 1 11 12
Convolution              conv_13                  1 1 12 13 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_79                  1 1 13 14
BinaryOp                 add_0                    2 1 9 14 15 0=0
Convolution              conv_14                  1 1 5 16 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_80                  1 1 16 17
Concat                   cat_0                    2 1 15 17 18 0=0
Convolution              conv_15                  1 1 18 19 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_81                  1 1 19 20
Convolution              conv_16                  1 1 20 21 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728
Swish                    silu_82                  1 1 21 22
Split                    splitncnn_2              1 2 22 23 24
Convolution              conv_17                  1 1 24 25 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_83                  1 1 25 26
Split                    splitncnn_3              1 2 26 27 28
Convolution              conv_18                  1 1 28 29 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_84                  1 1 29 30
Convolution              conv_19                  1 1 30 31 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_85                  1 1 31 32
BinaryOp                 add_1                    2 1 27 32 33 0=0
Split                    splitncnn_4              1 2 33 34 35
Convolution              conv_20                  1 1 35 36 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_86                  1 1 36 37
Convolution              conv_21                  1 1 37 38 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_87                  1 1 38 39
BinaryOp                 add_2                    2 1 34 39 40 0=0
Convolution              conv_22                  1 1 23 41 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_88                  1 1 41 42
Concat                   cat_1                    2 1 40 42 43 0=0
Convolution              conv_23                  1 1 43 44 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_89                  1 1 44 45
Split                    splitncnn_5              1 2 45 46 47
Convolution              conv_24                  1 1 47 48 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=294912
Swish                    silu_90                  1 1 48 49
Split                    splitncnn_6              1 2 49 50 51
Convolution              conv_25                  1 1 51 52 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_91                  1 1 52 53
Split                    splitncnn_7              1 2 53 54 55
Convolution              conv_26                  1 1 55 56 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_92                  1 1 56 57
Convolution              conv_27                  1 1 57 58 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_93                  1 1 58 59
BinaryOp                 add_3                    2 1 54 59 60 0=0
Split                    splitncnn_8              1 2 60 61 62
Convolution              conv_28                  1 1 62 63 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_94                  1 1 63 64
Convolution              conv_29                  1 1 64 65 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_95                  1 1 65 66
BinaryOp                 add_4                    2 1 61 66 67 0=0
Split                    splitncnn_9              1 2 67 68 69
Convolution              conv_30                  1 1 69 70 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_96                  1 1 70 71
Convolution              conv_31                  1 1 71 72 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_97                  1 1 72 73
BinaryOp                 add_5                    2 1 68 73 74 0=0
Convolution              conv_32                  1 1 50 75 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_98                  1 1 75 76
Concat                   cat_2                    2 1 74 76 77 0=0
Convolution              conv_33                  1 1 77 78 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_99                  1 1 78 79
Split                    splitncnn_10             1 2 79 80 81
Convolution              conv_34                  1 1 81 82 0=512 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1179648
Swish                    silu_100                 1 1 82 83
Split                    splitncnn_11             1 2 83 84 85
Convolution              conv_35                  1 1 85 86 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_101                 1 1 86 87
Split                    splitncnn_12             1 2 87 88 89
Convolution              conv_36                  1 1 89 90 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_102                 1 1 90 91
Convolution              conv_37                  1 1 91 92 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_103                 1 1 92 93
BinaryOp                 add_6                    2 1 88 93 94 0=0
Convolution              conv_38                  1 1 84 95 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_104                 1 1 95 96
Concat                   cat_3                    2 1 94 96 97 0=0
Convolution              conv_39                  1 1 97 98 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_105                 1 1 98 99
Convolution              conv_40                  1 1 99 100 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_106                 1 1 100 101
Split                    splitncnn_13             1 2 101 102 103
Pooling                  maxpool2d_72             1 1 103 104 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_14             1 2 104 105 106
Pooling                  maxpool2d_73             1 1 106 107 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_15             1 2 107 108 109
Pooling                  maxpool2d_74             1 1 109 110 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_4                    4 1 102 105 108 110 111 0=0
Convolution              conv_41                  1 1 111 112 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_107                 1 1 112 113
Convolution              conv_42                  1 1 113 114 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_108                 1 1 114 115
Split                    splitncnn_16             1 2 115 116 117
Interp                   upsample_135             1 1 117 118 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_5                    2 1 118 80 119 0=0
Split                    splitncnn_17             1 2 119 120 121
Convolution              conv_43                  1 1 121 122 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_109                 1 1 122 123
Convolution              conv_44                  1 1 123 124 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_110                 1 1 124 125
Convolution              conv_45                  1 1 125 126 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Convolution              conv_46                  1 1 120 127 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_112                 1 1 127 128
Swish                    silu_111                 1 1 126 129
Concat                   cat_6                    2 1 129 128 130 0=0
Convolution              conv_47                  1 1 130 131 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_113                 1 1 131 132
Convolution              conv_48                  1 1 132 133 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_114                 1 1 133 134
Split                    splitncnn_18             1 2 134 135 136
Interp                   upsample_136             1 1 136 137 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_7                    2 1 137 46 138 0=0
Split                    splitncnn_19             1 2 138 139 140
Convolution              conv_49                  1 1 140 141 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_115                 1 1 141 142
Convolution              conv_50                  1 1 142 143 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_116                 1 1 143 144
Convolution              conv_51                  1 1 144 145 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_52                  1 1 139 146 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_118                 1 1 146 147
Swish                    silu_117                 1 1 145 148
Concat                   cat_8                    2 1 148 147 149 0=0
Convolution              conv_53                  1 1 149 150 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_119                 1 1 150 151
Split                    splitncnn_20             1 3 151 152 153 154
Convolution              conv_54                  1 1 154 155 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Swish                    silu_120                 1 1 155 156
Concat                   cat_9                    2 1 156 135 157 0=0
Split                    splitncnn_21             1 2 157 158 159
Convolution              conv_55                  1 1 159 160 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_121                 1 1 160 161
Convolution              conv_56                  1 1 161 162 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_122                 1 1 162 163
Convolution              conv_57                  1 1 163 164 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Convolution              conv_58                  1 1 158 165 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_124                 1 1 165 166
Swish                    silu_123                 1 1 164 167
Concat                   cat_10                   2 1 167 166 168 0=0
Convolution              conv_59                  1 1 168 169 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_125                 1 1 169 170
Split                    splitncnn_22             1 2 170 171 172
Convolution              conv_60                  1 1 172 173 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=589824
Swish                    silu_126                 1 1 173 174
Concat                   cat_11                   2 1 174 116 175 0=0
Split                    splitncnn_23             1 2 175 176 177
Convolution              conv_61                  1 1 177 178 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_127                 1 1 178 179
Convolution              conv_62                  1 1 179 180 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_128                 1 1 180 181
Convolution              conv_63                  1 1 181 182 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Convolution              conv_64                  1 1 176 183 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_130                 1 1 183 184
Swish                    silu_129                 1 1 182 185
Concat                   cat_12                   2 1 185 184 186 0=0
Convolution              conv_65                  1 1 186 187 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
MemoryData               pnnx_53                  0 1 188 0=2 1=20 11=20 2=3
MemoryData               pnnx_54                  0 1 189 0=2 1=20 11=20 2=3
MemoryData               pnnx_55                  0 1 190 0=2 1=40 11=40 2=3
MemoryData               pnnx_56                  0 1 191 0=2 1=40 11=40 2=3
MemoryData               pnnx_58                  0 1 192 0=2 1=80 11=80 2=3
MemoryData               pnnx_60                  0 1 193 0=2 1=80 11=80 2=3
Convolution              conv_66                  1 1 153 194 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_132                 1 1 194 195
Interp                   upsample_137             1 1 195 196 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Convolution              conv_67                  1 1 196 197 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_133                 1 1 197 198
Convolution              conv_68                  1 1 198 199 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              conv_69                  1 1 152 200 0=351 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=44928
Reshape                  view_141                 1 1 200 201 0=80 1=80 11=117 2=3
Permute                  permute_147              1 1 201 202 0=3
Slice                    split_0                  1 4 202 203 204 205 206 -23300=4,2,2,81,32 1=3
MemoryData               pnnx_fold_604            0 1 207 0=1
Sigmoid                  sigmoid_0                1 1 203 208
Eltwise                  weighted_sum_0           2 1 208 193 209 0=1 -23301=2,2.000000e+00,1.000000e+00
BinaryOp                 mul_9                    2 1 209 207 210 0=2
Sigmoid                  sigmoid_1                1 1 204 211
BinaryOp                 mul_10                   1 1 211 212 0=2 1=1 2=2.000000e+00
UnaryOp                  pow_11                   1 1 212 213 0=4
BinaryOp                 mul_12                   2 1 213 192 214 0=2
Sigmoid                  sigmoid_2                1 1 205 215
Concat                   cat_13                   4 1 210 214 215 206 216 0=3
Convolution              conv_70                  1 1 171 217 0=351 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=89856
Reshape                  view_142                 1 1 217 218 0=40 1=40 11=117 2=3
Permute                  permute_148              1 1 218 219 0=3
Slice                    split_1                  1 4 219 220 221 222 223 -23300=4,2,2,81,32 1=3
MemoryData               pnnx_fold_643            0 1 224 0=1
Sigmoid                  sigmoid_3                1 1 220 225
Eltwise                  weighted_sum_1           2 1 225 191 226 0=1 -23301=2,2.000000e+00,1.000000e+00
BinaryOp                 mul_15                   2 1 226 224 227 0=2
Sigmoid                  sigmoid_4                1 1 221 228
BinaryOp                 mul_16                   1 1 228 229 0=2 1=1 2=2.000000e+00
UnaryOp                  pow_17                   1 1 229 230 0=4
BinaryOp                 mul_18                   2 1 230 190 231 0=2
Sigmoid                  sigmoid_5                1 1 222 232
Concat                   cat_14                   4 1 227 231 232 223 233 0=3
Swish                    silu_131                 1 1 187 234
Convolution              conv_71                  1 1 234 235 0=351 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=179712
Reshape                  view_143                 1 1 235 236 0=20 1=20 11=117 2=3
Permute                  permute_149              1 1 236 237 0=3
Slice                    split_2                  1 4 237 238 239 240 241 -23300=4,2,2,81,32 1=3
MemoryData               pnnx_fold_682            0 1 242 0=1
Sigmoid                  sigmoid_6                1 1 238 243
Eltwise                  weighted_sum_2           2 1 243 189 244 0=1 -23301=2,2.000000e+00,1.000000e+00
BinaryOp                 mul_21                   2 1 244 242 245 0=2
Sigmoid                  sigmoid_7                1 1 239 246
BinaryOp                 mul_22                   1 1 246 247 0=2 1=1 2=2.000000e+00
UnaryOp                  pow_23                   1 1 247 248 0=4
BinaryOp                 mul_24                   2 1 248 188 249 0=2
Sigmoid                  sigmoid_8                1 1 240 250
Concat                   cat_15                   4 1 245 249 250 241 251 0=3
Reshape                  view_146                 1 1 216 252 0=117 1=19200
Reshape                  view_145                 1 1 233 253 0=117 1=4800
Reshape                  view_144                 1 1 251 254 0=117 1=1200
Concat                   cat_16                   3 1 252 253 254 out0 0=0
Swish                    silu_134                 1 1 199 out1
