# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors: [[16,19], [55,65], [178,192]]
scales:  # model [depth, width] scaling multiples
  n: [0.33, 0.25]  # nano       231 layers, 2303184 parameters, 9.4 GFLOPs
  s: [0.33, 0.50]  # small      231 layers, 6690016 parameters, 6690000 gradients, 24.5 GFLOPs
  m: [0.67, 0.75]  # medium     301 layers, 19682608 parameters, 19682592 gradients, 73.0 GFLOPs
  l: [1.00, 1.00]  # large      371 layers, 43889664 parameters, 43889648 gradients, 165.1 GFLOPs
  x: [1.00, 1.25]  # x-large    371 layers, 68538768 parameters, 68538752 gradients, 257.6 GFLOPs

# YOLOv8 v0.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 3, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C2f, [128, True]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C2f, [256, True]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 6, C2f, [512, True]],
   [-1, 1, Conv, [512, 3, 2]],  # 7-P5/32
   [-1, 3, C2f, [512, True]],
   [-1, 1, SPPF, [512, 5]],  # 9
  ]

# YOLOv8 v0.0 head
head:
  [[-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C2f, [512]],  # 13

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C2f, [256]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 12], 1, Concat, [1]],  # cat head P4
   [-1, 3, C2f, [512]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 9], 1, Concat, [1]],  # cat head P5
   [-1, 3, C2f, [512]],  # 23 (P5/32-large)

   [[15, 18, 21], 1, V6Detect, [nc]],  # Detect(P3, P4, P5)
  ]
