# 
# correct code with 321 with C3_allS
# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],               # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],            # 1-P2/4
   [-1, 3, C3_2, [128]],                  # 2-offload cv1's bn & cv3's act
   [-1, 1, Conv_in, [256, 3, 2]],         # 3-P3/8
   [-1, 9, C3_4, [256]],                  # 4-offload...
   [-1, 1, Conv_in110, [512, 3, 2]],      # 5-P4/16-offload all (cause 12 cat,shouldn't off act here)
   [-1, 9, C3_6, [512]],                  # 6-offload bl of cv1 & m & cbl of cv2 & cv3
   [-1, 1, Conv_in110, [1024, 3, 2]],     # 7-P5/32-offload all (cause 22 cat,shouldn't off act here)
   [-1, 1, SPP_8, [1024, [5, 9, 13]]],    # 8-offload cv1/cv2(??yaobuyao all)
   [-1, 3, C3_9, [1024, False]],          # 9-offload all(include cat)
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv_in110, [512, 1, 1]],      # 10-offload all (cause 11 ,couldn't off act)
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 11
   [[-1, 6], 1, Concat, [1]],             # 12 cat backbone P4
   [-1, 3, C3_9, [512, False]],           # 13-offload all(include input,cat)

   [-1, 1, Conv_in110, [256, 1, 1]],      # 14-offload all (couldn't off act)
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 15
   [[-1, 4], 1, Concat, [1]],             # 16 cat backbone P3
   [-1, 3, C3_17, [256, False]],          # 17 (P3/8-small)-offload all except cv3(include cat)

   [-1, 1, Conv_110, [256, 3, 2]],        # 18-offload conv,bn(couldn't off act)
   [[-1, 14], 1, Concat, [1]],            # 19 cat head P4
   [-1, 3, C3_9, [512, False]],           # 20 (P4/16-medium)-offload all(include input,cat)(cause 24 ,shouldn't off act here)

   [-1, 1, Conv_110, [512, 3, 2]],        # 21-offload conv,bn(couldn't off act)
   [[-1, 10], 1, Concat, [1]],            # 22 cat head P5
   [-1, 3, C3_9, [1024, False]],          # 23 (P5/32-large)-offload all(include input,cat)

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)-offload the first conv2d
  ]