# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Parameters
nc: 80 # number of classes
depth_multiple: 1.0 # model depth multiple
width_multiple: 1.0 # layer channel multiple
anchors:
  - [4,5, 8,10, 12,15]           # P2/4 small-object anchors (approx.)
  - [10,13, 16,30, 33,23]        # P3/8
  - [30,61, 62,45, 59,119]       # P4/16
  - [116,90, 156,198, 373,326]   # P5/32
  - [200,180, 300,280, 620,600]   # P6/64


# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [64, 6, 2, 2]], # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]], # 1-P2/4
    [-1, 3, C3, [128]],
    [-1, 1, Conv, [256, 3, 2]], # 3-P3/8
    [-1, 6, C3, [256]],
    [-1, 1, Conv, [512, 3, 2]], # 5-P4/16
    [-1, 9, C3, [512]],
    [-1, 1, Conv, [1024, 3, 2]], # 7-P5/32
    [-1, 3, C3, [1024]],
    [-1, 1, Conv, [2048, 3, 2]], # 9-P6/32
    [-1, 3, C3, [2048]],
    [-1, 1, SPPF, [2048, 5]], # 11
  ]

# YOLOv5 v6.0 head
head: [
    [-1, 1, Conv, [1024, 1, 1]], #12
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], #13
    [[-1, 8], 1, Concat, [1]], # cat backbone P5
    [-1, 3, C3, [1024, False]], # 15

    [-1, 1, Conv, [512, 1, 1]], #16
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 6], 1, Concat, [1]], # cat backbone P4
    [-1, 3, C3, [512, False]], # 19 


    [-1, 1, Conv, [256, 1, 1]], #20
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 4], 1, Concat, [1]], # cat backbone P3
    [-1, 3, C3, [256, False]], # 23 (P3/8-small)

    [-1, 1, Conv, [128, 1, 1]], #24
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 1], 1, Concat, [1]], # cat backbone P2
    [-1, 3, C3, [128, False]], # 27 (P2/84small)

    [-1, 1, Conv, [128, 3, 2]], #28
    [[-1, 24], 1, Concat, [1]], # cat head P3
    [-1, 3, C3, [256, False]], # 30 (P3/32)

    [-1, 1, Conv, [256, 3, 2]], #31
    [[-1, 20], 1, Concat, [1]], # cat head P4
    [-1, 3, C3, [512, False]], # 33 (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]], #34
    [[-1, 16], 1, Concat, [1]], # cat head P5
    [-1, 3, C3, [1024, False]], # 36 (P5/32-large)

    [-1, 1, Conv, [1024, 3, 2]], #37
    [[-1, 12], 1, Concat, [1]], # cat head P6
    [-1, 3, C3, [2048, False]], # 39 (P68/32-large)

    [[27, 30, 33, 36, 39], 1, DetectRAYOLO, [nc, anchors]], # Detect(P2, P3, P4, P5, P6)
  ]
    