# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# 0-P1/2
# 1-P2/4
# 2-P3/8
# 3-P4/16
# 4-P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, od_mobilenetv2_050, [ odconv1x_mobilenetv2_050.pth.tar, 1]], # 0
   [-1, 1, SPPF, [1024, 5]],  # 1
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]], # 2
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 3
   [[-1, 3], 1, Concat, [1]],  # cat backbone P4 4
   [-1, 3, C3, [512, False]],  # 5

   [-1, 1, Conv, [256, 1, 1]], # 6
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 7
   [[-1, 2], 1, Concat, [1]],  # cat backbone P3 8
   [-1, 3, C3, [256, False]],  # 9 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]], # 10
   [[-1, 10], 1, Concat, [1]],  # cat head P4 11
   [-1, 3, C3, [512, False]],  # 12 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]], # 13
   [[-1, 5], 1, Concat, [1]],  # cat head P5 14
   [-1, 3, C3, [1024, False]],  # 15 (P5/32-large)

   [[9, 12, 15], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]