# parameters
nc: 20  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  #- [5,6, 7,9, 12,10]      # P2/4
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]               # [c=channels,module,kernlsize,strides]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2           [c=3,64*0.5=32,3]
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4    
   [-1, 3, C3, [128]],
   [-1, 3, CoordAtt, [128]],                                
   [-1, 1, Conv, [256, 3, 2]],  # 4-P3/8            
   [-1, 9, C3, [256]],
   [-1, 3, CoordAtt, [256]] ,                         
   [-1, 1, Conv, [512, 3, 2]],  # 7-P4/16       
   [-1, 9, C3, [512]],
   [-1, 3, CoordAtt, [512]],                     
   [-1, 1, Conv, [1024, 3, 2]],  # 10-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C3, [1024]],  # 12
   [-1, 3, CoordAtt, [1024]], #13
    
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 7], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 17

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 21 (P3/8-small)
   #[-1, 3, CBAM, [256]],  #22
   #[-1, 3, C3, [256]],

   [-1, 1, Conv, [256, 3, 2]], 
   [[-1, 18], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 24 (P4/16-medium)       [256, 256, 1, False]  
   #[-1, 3, CBAM, [512]],   #26
   #[-1, 3, C3, [512]], 

   [-1, 1, Conv, [512, 3, 2]],    #27                       #[256, 256, 3, 2] 
   [[-1, 14], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 29 (P5/32-large)       [512, 512, 1, False]
   #[-1, 3, CBAM, [1024]],   #30
   #[-1, 3, C3, [1024]],

   [[21, 24, 27], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
